## SQLite и Pandas

Сегодня мы поработаем над тем как извлекать данные из базы данных SQLite. Для начала импортируем нужные нам библиотечки.

In [52]:
import sqlite3
import pandas as pd

In [53]:
# Создаем коннектор к файлу нашей базы данных. 
# Само собой, файлик Базы Данных должен лежать рядом с файлом блокнота (который вы сейчас читаете). 
con = sqlite3.connect('EmployeePoints.db')

In [54]:
# Не спрашивайте
cur = con.cursor()

In [55]:
# Таким образом исполняется запрос к Базе Данных. 
# Здесь Python передает предложение SELECT в СУБД (в данном случае это библиотечка sqlite3) и выполняет его, а возвращает набор данных из таблицы (результат работы SELECT)

cur.execute('SELECT * FROM EmployeePoints').fetchall()

[('Маша', 5, '2020-01-01'),
 ('Петя', 4, '2020-01-01'),
 ('Вася', 3, '2020-01-01'),
 ('Саша', 4, '2020-01-01'),
 ('Маша', 4, '2020-01-02'),
 ('Петя', 4, '2020-01-02'),
 ('Вася', 4, '2020-01-02'),
 ('Саша', 5, '2020-01-02'),
 ('Маша', 5, '2020-01-03'),
 ('Петя', 3, '2020-01-03'),
 ('Вася', 2, '2020-01-03'),
 ('Саша', 5, '2020-01-03'),
 ('Маша', 3, '2020-01-04'),
 ('Петя', 3, '2020-01-04'),
 ('Вася', 3, '2020-01-04'),
 ('Саша', 3, '2020-01-04'),
 ('Максим', 2, '2020-01-04'),
 ('Маша', 5, '2020-01-05'),
 ('Петя', 3, '2020-01-05'),
 ('Вася', 3, '2020-01-05'),
 ('Саша', 3, '2020-01-05')]

In [57]:
# Можно выполнять и более сложные селекты

cur.execute("""
   select DISTINCT(Employee) from EmployeePoints;
""").fetchall()

[('Маша',), ('Петя',), ('Вася',), ('Саша',), ('Максим',)]

# Pandas

In [58]:
df = pd.read_sql("""

    select DISTINCT(Employee) from EmployeePoints;
    
""", con)

In [59]:
df

  Employee
0     Маша
1     Петя
2     Вася
3     Саша
4   Максим

In [61]:
df = pd.read_sql("""

    select Employee, count(Point) FROM EmployeePoints where point = 5 group by Employee  order by point;

""", con)

In [62]:
df

  Employee  count(Point)
0     Маша             3
1     Саша             2